{
    "Movies": [
          {
               "title": "Alladin",
               "src": "https://th.bing.com/th/id/OIP.cxbn2mBcs9sVoWCNkwGNHwHaEK?w=272&h=180&c=7&r=0&o=5&pid=1.7",
               "description": "Aladdin is a street-urchin who lives in Agrabah, a large and busy town with his faithful monkey friend Abu. When Princess Jasmine gets tired of being forced to remain in the palace that overlooks the city, she sneaks out to the marketplace, where she accidentally meets Aladdin.",
               "id": "1"
          },
          {
               "title": "Brave",
               "src": "https://th.bing.com/th/id/R.74f51f8fc63c7d2a6741db2fe2af85e4?rik=kFKVrJXfPilOvA&riu=http%3a%2f%2f3.bp.blogspot.com%2f-IcLHyccpZkE%2fUBcPpA4SXrI%2fAAAAAAAAN4s%2fODlbYNB5Md4%2fs1600%2fbrave-char-thumb.jpg&ehk=1e%2fuoy%2b5zlqMHPbVfoLvdM5ZvEFBD68uMQiA0ThaLj4%3d&risl=&pid=ImgRaw&r=0",
               "description": "Brave is a 2012 American computer-animated fantasy film produced by Pixar Animation Studios and released by Walt Disney Pictures. It was directed by Mark Andrews (in his feature-length directorial debut) and Brenda Chapman and co-directed by Steve Purcell. The story is by Chapman, with the screenplay by Andrews, Purcell, Chapman and Irene Mecchi.",
               "id": "2"
          },
          {
               "title": "The Lion King",
               "src": "https://th.bing.com/th/id/R.8668eff078363546fdc625ffaf0cbb4e?rik=bq54xvp2yWSNQw&pid=ImgRaw&r=0",
               "description": "The Lion King is an animated movie made by Walt Disney in 1994. It was the most successful animated movie of the 1990s. The movie is about a young lion prince who learns about his role as prince and in the circle of life.",
               "id": "3"
          },
          {
               "title": "Encanto",
               "src": "https://th.bing.com/th/id/OIP.RRVAxCNgYx9HpmU4shPssAHaFO?pid=ImgDet&rs=1",
               "description": " “Walt Disney Animation Studios’ upcoming feature film ‘Encanto’ tells the tale of the Madrigals, an extraordinary family who live in a wondrous, charmed place called an Encanto. Each child has been blessed with a magic gift unique to them — each child except Mirabel.",
               "id": "4"
          },
          {
               "title": "Eternals",
               "src": "https://th.bing.com/th/id/OIP.dtBQqxFanUi9AyN0rcydjAHaEN?pid=ImgDet&rs=1",
               "description": "Eternals is a 2021 American superhero film based on the Marvel Comics race of the same name. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the 26th film in the Marvel Cinematic Universe (MCU). The film is directed by Chloé Zhao, who wrote the screenplay with Patrick Burleigh, Ryan Firpo, and Kaz Firpo.",
               "id": "5"
          },
          {
               "title": "Frozen",
               "src": "https://br.jetss.com/wp-content/uploads/2020/04/20190930-frozen-2-song-1200x675-1.jpg",
               "description": "Frozen is a 2013 American 3D computer-animated adventure musical fantasy comedy-drama film, created and produced at Walt Disney Animation Studios and distributed by Walt Disney Studios Motion Pictures. Inspired by the Hans Christian Andersen fairy tale, The Snow Queen, it is the 53rd animated feature in the Disney Animated Canon",
               "id": "6"
          },
          {
               "title": "Home",
               "src": "https://th.bing.com/th/id/R.a94ed83321ba1817af427ddfff8d04be?rik=OkZs9eYiws%2fehQ&riu=http%3a%2f%2fwww.cartoondistrict.com%2fwp-content%2fuploads%2f2015%2f01%2fbest-upcoming-Cartoon-Movies3-003.jpg&ehk=i9hHYMEks30RZIh7HMZlVQcT3jRH5uuqZXFWttZdaM8%3d&risl=&pid=ImgRaw&r=0",
               "description": "Home Movie is a 2008 found footage psychological horror film and is the directorial debut of actor Christopher Denham. The film received favorable reviews at Montreal’s 2008 Fantasia Film Festival.",
               "id": "7"
          },
          {
               "title": "Moana",
               "src": "https://th.bing.com/th/id/R.ebae9eeea309dc824b26f5f1c0602117?rik=u7YBdgTbiV1pbw&pid=ImgRaw&r=0",
               "description": "Moana is a Disney film that opened in 2016 to critical acclaim. Directed by Ron Clements and John Musker, it features an adventurous teenager named Moana living on a Polynesian island in ancient times. The plot follows the track of self-discovery and self-realization, as Moana finds her true leadership qualities through her perils.",
               "id": "8"
          },
          
          {
               "title": "Luca",
               "src": "https://th.bing.com/th/id/OIP.VqqSBDyCYu4pQlAkBWXv5wHaEK?pid=ImgDet&rs=1",
               "description": "Set in a beautiful seaside town on the Italian Riviera, Disney and Pixar’s original feature film “Luca” is a coming-of-age story about one young boy experiencing an unforgettable summer filled with gelato, pasta and endless scooter rides.",
               "id": "9"
          },
          {
               "title": "Raya",
               "src": "https://th.bing.com/th/id/OIP.sGRr2H4pAPaCqCisgThnlgHaEK?pid=ImgDet&rs=1",
               "description": "Raya is the titular protagonist of Disney 's 2021 animated feature film Raya and the Last Dragon. The daughter of Chief Benja, she is the princess of Kumandra 's Heart Land. In her youth, Raya was appointed the Guardian of the Dragon Gem.",
               "id": "10"
          },
          {
               "title": "Fast and Furious 9",
               "src": "https://th.bing.com/th/id/OIP.7wyDgwZC2ys4v-Tj62MyKgHaD5?pid=ImgDet&rs=1",
               "description": "Fast & Furious 9 is a 2021 American drama film directed by Fisher Stevens and written by Cheryl Guerriero. It stars Justin Timberlake as a former college football star, now an ex-convict, who starts to mentor a young boy (Ryder Allen); Alisha Wainwright, June Squibb, and Juno Temple also star.",
               "id": "11"
          },
          {
               "title": "Lockdown",
               "src": "https://th.bing.com/th/id/OIP.Q5zEfciUJIEN5tGSo11b5QHaEK?pid=ImgDet&rs=1",
               "description": "Lockdown is an upcoming global pandemic thriller film written and directed by Bizhan Tong. The film stars Xander Berkeley and Kevin Leslie, with an international cast including Anita Chui, John Savage, Alix Wilton Regan, Pamela Nomvete, and Mike Leeder in supporting roles.",
               "id": "12"
          }
          
          
    ]
}
     
